{"intents": [{
      "tag": "greeting",
      "patterns": [ "Hi", "How are you", "Is anyone there?", "Hello", "Good day" ],
      "responses": [ "Hello, thanks for visiting", "Good to see you again", "Hi there, how can I help?" ],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": [ "Bye", "See you later", "Goodbye" ],
      "responses": [ "See you later, thanks for visiting", "Have a nice day", "Bye! Come back again soon." ]
    },
    {
      "tag": "positive",
      "patterns": [ "Thanks", "Thank you", "Thats helpful" ],
      "responses": [ "Happy to help!", "Any time!", "My pleasure" ]
    },
    {
      "tag": "negative",
      "patterns": [ "this is not what", "No", "useless" ],
      "responses": [ "Sorry, did I give the wrong answer?","Is it not what you were looking for?" ]
    },
    {
    "tag": "Fees", 
    "patterns": ["How can I find out how much I have to pay?", "Why am I charged as a \"non Quebec resident\" when I am definitely a Quebec resident?", "What if I apply for Quebec Resident status but my residency status is not approved before the fee payment deadline?", "When are my fees due; when must they be paid?", "How can I pay my fees?", "Will I be charged a late payment fee or interest if I pay my fees at my bank by the deadline date?", "What happens if I miss the payment deadline and dont pay my fees on time?", "How are the tuition and compulsory fees charged?", "How can I find out how much I have to pay?", "Financial support for Meng in Electrical and Computer Engineering"], "responses": ["Go to your student portal under the MyConcordia Menu choose \"Financial » Students Account\". Your student account will indicate the amount due each term and the deadline date by which your payment must appear on your student account.", "The Quebec government sets the rules for determining a students Quebec residency status.\n\nAccording to these rules, students who are Canadian citizens, Canadian First Nations members or permanent Residents of Canada who live in Quebec are considered to be non Quebec residents until they prove their Quebec residency status. Go to the Quebec Residency website for further information.\n\nIf you were born in Quebec, simply submit a clear copy of your Quebec Birth Certificate to the Birks Student Service Centre, S LB 185.", "If your application to pay Quebec Resident fees has not been approved by the government on or before the Universitys fee payment deadline, then you must pay the fees indicated on your portal Students Account. If your application is approved after the deadline, your student account will be credited the difference.", "Tuition and compulsory fees become due on May 1 (Summer session), September 1 (Fall term) and January 1 (Winter term).They must be paid for Summer term fees:May 31st,Fall term fees:September 30th,Winter term fees:January 31st", "The University does not accept cash for the payment of student tuition and other fees. For a complete list of methods of payment, please visit: http://www.concordia.ca/admissions/tuition fees/fee payment deadlines/methods of payment.html", "Yes", "You will be charged a Late Payment fee and monthly interest. Visit the \"How fees are billed\" webpage for information regarding the consequences of late payment of fees.", "Full time students:Tuition and other fees will be charged at a maximum rate of 11.25 credits per term until all nominal credits in a students program have been billed.Part time students\nTuition and other fees will be charged at a maximum rate of 7.5 credits per term until all nominal credits in a students program have been billed.", "Go to your student portal under the MyConcordia Menu choose \"Financial » Student’s Account\". Your student account will indicate the amount due each term and the deadline date by which your payment must appear on your student account.", "Teaching Assistant (TA) assignments are awarded to qualified graduate students (PhD, MASc, MEng). The basic requirements are technical knowledge and good communication skills as demonstrated by past experience and academic record."]
    }, 
    {
    "tag": "General", 
    "patterns": ["Who sets the tuition fee rates for studying in Quebec?"], 
    "responses": ["The Quebec Ministry of Education, Leisure and Sports sets the base tuition fee rate as well as the rates of premiums, or forfaitaires, charged to non Quebec residents and International students. Additional information is available on the Ministere de lEducation, Loisirs et Sportswebsite."]
    }, 
    {
    "tag": "Health", "patterns": ["Do I have to pay a Health Insurance premium if I am an international student?", "Do I have to pay the Student Health & Dental Care Plan premium? Can I opt out of the plan?", "Can I enrol in the Student Health and Dental Care Plan if I am an International student or a member of Canadian First Nations?"], "responses": ["Yes.The Ministry of Education requires that all Quebec universities insure their international students. A certain category of students may be eligible for an exemption from the Concordia Health Insurance Plan for international students, for example students possessing a Quebec Medicare card. For full details on exemptions, procedures and deadlines, please visit http://supportservices.concordia.ca/iso/healthinsurance/exemptions/", "Yes.Undergraduate students registered for more than 3 credits in a fall and/or winter term and who are Canadian citizens or permanent Residents of Canada are automatically enrolled in the Student Health and Dental Plan. Canadian First Nations members and International students are not automatically enrolled in the plans but may “opt into” the plan (See FAQ Can I enrol in the Student Health and Dental Care Plan).", "Canadian First Nations members International students may purchase Student Health and Dental Care Plan coverage directly from the CSU ’s insurance broker, ASEQ at www.ihaveaplan.ca."]
    }, 
    {
    "tag": "Fees", 
    "patterns": ["Can fee payment arrangements be made?", "What if my embassy (company, sponsor, etc.) is paying my fees?", "I am a staff member – How do I get information about Staff Tuition Waivers?"], "responses": ["If you have an Accounts Restriction because you have an outstanding balance and you wish to continue registering in courses for the current or future academic terms you may be eligible to negotiate payment arrangements with the Student Accounts Office.", "Students whose fees are paid directly to the University by a “Sponsor” must submit proof of sponsorship to the Student Accounts Office. Please visit the \"How fees are billed\" webpage for more information", "As a staff member, you, your spouse and your dependents may be eligible to receive a Staff Tuition Waiver. If eligible, the staff tuition waiver will cover the base tuition fees charged on credit courses. The remaining fees must be paid by the student. In addition, the waiver is a taxable benefit for the student and a T4A will be issued by the University at the end of the taxation year."]
    }, 
    {
    "tag": "Refunds", "patterns": ["Do I get a refund when I drop a course?"], "responses": ["Yes and no.There are 2 different kinds of withdrawal/drop deadlines. One will generate a refund or a financial credit on the student’s account; the other will not.DNE (Did not enter) withdrawal deadline = full refund or financial credit on account. DISC (Discontinued) withdrawal deadline = no refund or financial credit on account"]
    }, 
    {
    "tag": "Other", "patterns": ["Can I obtain official transcripts if I havent paid all my fees?", "Can I attend convocation (graduation ceremonies) if I havent paid all my fees?", "Can I attend convocation (graduation ceremonies) if I havent paid all my fees?", "Faculty research interests"], "responses": ["No.", "No.", "No", "ECE produces a high level of research activity that benefits from more than 1.5 million dollars in annual funding. Faculty members are involved in eleven areas of research:Systems, control and robotics, Circuits and systems; communications, Computer communications and protocols, Signal processing, High performance architecture, Software engineering, VLSI systems, Microelectronics, Microwave and optoelectronics, Antennas and electromagnetic compatibility, Power electronics and adjustable speed drives"]
    }, 
    {
    "tag": "Courses", "patterns": ["Can I register for courses that do not apply to my degree requirements?", "Can I audit a course?", "Course curriculum for Meng in Electrical and Computer Engineering", "Course curriculum for Electrical Engineering Beng", "Co op program for Electrical Engineering Beng", "Curriculum"], "responses": ["Yes", "Yes", "https://www.concordia.ca/academics/graduate/calendar/current/encs/engineering courses.html#COEN ELEC", "https://www.concordia.ca/academics/undergraduate/calendar/current/sec71/71 30.html#b71.30.1", "The Co op program gives you the chance to complete paid work terms that last 12 to 16 weeks. As a Co op student, you will work for engineering firms", "Students must complete 45 credits as shown below.Courses: A minimum of 16 credits chosen from the Engineering Courses section, approved by the student’s supervisor and either the Graduate Program Director or the chair of the department. Thesis: 29 credits."]
    }, 
    {
    "tag": "Admission", 
    "patterns": ["Admission requirements for Meng in Electrical and Computer Engineering", "Degree requirements for Meng in Electrical and Computer Engineering", "Application process for Meng in Electrical and Computer Engineering", "Application deadlines for Meng in Electrical and Computer Engineering", "Program options & degree requirements for Electrical Engineering BEng", "Admission requirements for Electrical Engineering Beng", "Application deadlines for Electrical Engineering Beng", "Admission requirements", "Degree requirements"], "responses": ["Applicants to the MEng Program must hold a bachelor’s degree in engineering or equivalent with high standing. Applicants with a bachelor’s degree in architecture with high engineering content may also be considered for the MEng program. Such students will be required to enrol in an extended program. The GCS Graduate Studies Committee will determine the acceptability of an applicant for admission to the program and may require an applicant to take specified undergraduate courses in order to qualify for acceptance. Qualified applicants requiring prerequisite courses may be required to take such courses in addition to their regular graduate program. Applicants with deficiencies in their undergraduate preparation may be required to take a qualifying program. An ability to write simple programs in a standard computer language will be assumed. Students lacking this skill will be required to register for the appropriate course. This course will be taken in addition to regular degree requirements.", "Credits: A fully qualified candidate is required to complete successfully a minimum of 45 credits. For specific program requirements, refer to the relevant departmental entry in the following pages. Each individual program of study must be approved by the student’s department.Transfer Credits: Student may be granted transfer academic credits for, in general, not more than 12 credits taken in approved graduate studies prior to their entry into this program. A course submitted for transfer credits must be appropriate to the student’s program of study at Concordia University. An application for such credit will be considered only at the time of admission.Option Changes: Transfers between all Master’s programs at the Gina Cody School are considered option changes. All courses attempted in the original program are included in the new option and calculated in the CGPA.Other Courses: A limited number of credits are recognized toward the Master of/Magisteriate in Engineering degree for courses taken under the heading Impact of Engineering on Society and for cognate courses taken from the MBA program. For details refer to the relevant departmental entry in the following pages.Cross Registration: A student in the program wishing to take courses under the cross registration scheme must first obtain approval of the GCS Graduate Studies Committee.Time Limit:Please refer to the Academic Regulation page for further details regarding the Time Limit requirements. Project: Depending on individual department requirements, students may choose to do one or more projects as part of their program. They do so by registering for one or more of the sequence ENGR 6971, 6981, 6991. Where students choose to carry out a multi course project, the project will be graded by at least two professors.", "Please apply online. Read the how to guide for application procedures. 1. Submit your application and pay a $100CAD application fee.  A student ID number will be issued2. Log on to MyConcordia.ca portal to upload documents.3. A completed file that is ready to be assessed will include:Application form and Fee,Curriculum Vitae (CV),Three Letters of Reference and assessment form,Statement of purpose,Transcripts (with mark sheets if applicable) for all post secondary institutions attended,Proof of Canadian citizenship (if applicable),Applicants whose primary language is not English, are required to submit official language test scores, unless exempted.,For initial assessment purposes, scanned and uploaded copies of documents are accepted.  To finalize a file, once admitted, Concordia University will require official documents.", "Canadian/Permanent Resident—Meng—Fall(September)  05 Apr—Winter(January)—Oct.1 & International—Meng   Fall(September)  05 Apr—Winter(January)—15 Jun", "https://www.concordia.ca/academics/undergraduate/calendar/current/sec71/71 30.html#b71.30.1", "Minimum cut off averages  Quebec CEGEP: 24 overall, 23 math, 22 phys., Co op (CRC): 25,High School: B  overall, B  math, B  phys.,University Transfers (internal/external): B  overall, B  math, B  phys.,Bacc. français: 12 overall, 12 math, 12 phys.,International Baccalaureate (IB) diploma: 27 overall, 4 math, 4 phys.", "Canadian/Permanent Resident—Meng—Fall(September)  01 Feb—Winter(January)—Nov. 1 & International—Meng   Fall(September)  01 March—Winter(January)—01 Sep.", "Applicants to the MASc program should hold a bachelor’s degree in engineering or equivalent with high standing. Consideration will also be given to candidates with a degree in a cognate area with high standing; such students may be required to enrol in an extended program. In particular, applicants with a bachelor’s degree in architecture will be considered for the MASc in Building Engineering. The GCS Graduate Studies Committee will determine the acceptability of an applicant for admission to the program and may require an applicant to take specified undergraduate courses in order to qualify for acceptance. Qualified applicants requiring prerequisite courses may be required to take such courses in addition to their regular graduate program. Applicants with deficiencies in their undergraduate preparation may be required to take a qualifying program. An ability to write simple programs in a standard computer language will be assumed. Students lacking this skill will be required to register for a course prescribed by the Graduate Program Director. This course will be taken in addition to regular degree requirements.", "Credits: A fully qualified candidate is required to complete successfully a minimum of 45 credits. For specific program requirements, refer to the relevant departmental entry in the following pages. Each individual program of study must be approved by the student’s department and the GCS Graduate Studies Committee.,Transfer Credits: Students may be granted transfer academic credits for, in general, not more than eight credits taken in approved graduate studies prior to their entry into this program. A course submitted for transfer credits must be appropriate to the student’s program of study at Concordia University. An application for such credit will be considered only at the time of admission.,Option Changes: Transfers between all Master’s programs at the Gina Cody School are considered option changes. All courses attempted in the original program are included in the new option and calculated in the CGPA.,Thesis: Students must complete a 29 credit thesis as part of their degree requirements. The thesis must represent the results of the student’s independent work after admission to the program. The proposed topic for the thesis, together with a brief statement outlining the proposed method of treatment, and the arrangement made for faculty supervision, must be approved by the GCS Graduate Studies Committee. For purposes of registration, this work will be designated as ENGR 8901. The thesis will be evaluated by the student’s supervisor(s), and at least two examiners appointed by the GCS Graduate Studies Committee, one of whom shall be external to the student’s department.,Cross Registration: A student in the program wishing to take courses under the cross registration scheme must first obtain approval of the GCS Graduate Studies Committee. (See Inter University Agreement in Graduate Registration section),Time Limit: Please refer to the Academic Regulation page for further details regarding the Time Limit requirements."]}]}